# LoadItemFiles Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..LoadItemFiles Method
FabricationConfiguration Class See Also
---
Loads the specified fabrication item files into the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public IList<FabricationItemFile> LoadItemFiles(
	IList<FabricationItemFile> itemFiles
)
```

Visual Basic
---
```text
Public Function LoadItemFiles ( _
	itemFiles As IList(Of FabricationItemFile) _
) As IList(Of FabricationItemFile)
```

Visual C++
---
```text
public:
IList<FabricationItemFile^>^ LoadItemFiles(
	IList<FabricationItemFile^>^ itemFiles
)
```

# ### Parameters
itemFiles
    Type: System.Collections.Generic..::..IList<(Of <(<'FabricationItemFile>)>)> The relative paths of the fabrication item files to load.
# ### Return Value
The relative paths of the fabrication item files which failed to load.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The current fabrication configuration is not connected and updated to source configuration. Reload and try again. -or- this operation failed. |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace